# """
# 3 3
# 1 1 0
# 1 1 1
# 1 0 1
# 1 1 1
# """ 
# # 1

# """
# 11 10
# 7 4 0
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 0 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 0 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# """
# # out : 57
# print(sum(map(int,"""1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 0 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 0 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# 1 1 1 1 1 1 1 1 1 1
# """.split())))


# print(sum(map(int,"""1 1 1 1 1 1 1 1 1 1
# 1 0 0 0 0 0 0 0 0 1
# 1 0 0 0 1 1 1 1 0 1
# 1 0 0 1 1 0 0 0 0 1
# 1 0 1 1 0 0 0 0 0 1
# 1 0 0 0 0 0 0 0 0 1
# 1 0 0 0 0 0 0 1 0 1
# 1 0 0 0 0 0 1 1 0 1
# 1 0 0 0 0 0 1 1 0 1
# 1 0 0 0 0 0 0 0 0 1
# 1 1 1 1 1 1 1 1 1 1
# """.split())))

N, M = map(int, input().split())

r, c, d = map(int, input().split())

# ds = {
#     0 : (-1, 0),# 북, 상
#     1 : (0, 1), # 동, 우
#     2 : (1, 0), # 남, 하
#     3 : (0, -1) # 서, 좌
# }
dr = [-1, 0, 1, 0]
dc = [0, 1, 0, -1]
# r -= 1
# c -= 1

arr = [list(map(int, input().split())) for _ in range(N)]
cnt = 1
arr[r][c] = 2
nd = d

while True :
    for i in range(4):
        # 왼쪽 체크 (d - 1)
        nd = (nd + 3) % 4 
        nr = r + dr[nd]
        nc = c + dc[nd]
        # 외벽이 확정임으로 범위 비교 스킵
        # 0이면 이동
        if not arr[nr][nc] :
            cnt += 1
            arr[nr][nc] = cnt + 1 # 청소는 2 
            d = nd
            r, c = nr, nc
            break
        # 1이면 한번더d - 1
    else:
        # 4번 반복해서 없으면
        back_d = (d + 2) % 4
        br = r + dr[back_d]
        bc = c + dc[back_d]
        # 뒤 확인 (실제 회전 X)
        if arr[br][bc] == 1 : # 뒤가 벽이면 중단
            break
        
        r, c = br, bc
        # 뒤 없으면 후진 (방향 유지한 채로)

for i in arr:
    print(i)

print(cnt)